//!!!WARNING!!!
//Вносить измениния Осторожно!

const AllProducts = {

//  неСистемные:
//      [Название продукта, Грейс, Единоразовая комиссия, Ежемесячная комиссия, Страховка]
    notSystem: [
        ["2,9-2,9 Стандарт 36 мес.",           0, 2.9, 2.9, 0],
        ["4-4 Стандарт 36 мес.",               0, 4,   4,   0],
        ["3-3 Стандарт 36 мес. Со страх.",     0, 3,   3,   0],
        ["2.5-2.5 Стандарт 36 мес. Со страх.", 0, 2.5, 2.5, 0],
        ["0-5-36 Стандарт Страховка",          5, 0,   6,   1.98]
    ],

//  Comfy:
//      [Название продукта, Грейс, Единоразовая комиссия, Ежемесячная комиссия, Страховка]
    comfy: [
        ["Р3-24",     2, 0, 3.2,  0],
        ["Р5-24",     4, 0, 3.3,  0],
        ["Р7-24",     6, 0, 3.4,  0],
        ["Р10-24",    9, 0, 3.5,  0],
        ["Р12-24",   11, 0, 3.5,  0],
        ["Р15-24",   14, 0, 3.75, 0],
        ["Р18-24",   17, 0, 3.75, 0],
        ["Р20-24",   19, 0, 3.75, 0],
        ["Р25",      24, 0, 4,    0],
        ["10-10-10",  0, 0, 1.11, 0],
        ["K0/24/53",  0, 0, 3.4,  0]
    ],

//  Eldorado:
//      [Название продукта, Грейс, Единоразовая комиссия, Ежемесячная комиссия, Страховка]
    eldorado: [
        ["Стандарт",            0,  3.5, 3.5, 0],
        ["0-2-24",              2,  0,   3.5, 0],
        ["0-4-24",              4,  0,   3.5, 0],
        ["0-6-24",              6,  0,   3.5, 0],
        ["0-6-24 UF",           6,  7,   3.5, 0],
        ["0-8-24 с ед 5%",      8,  5,   3.5, 0],
        ["0-8-24 с ед 8%",      8,  8,   3.5, 0],
        ["0-9-24",              9,  0,   3.5, 0],
        ["0-9-24 с СК 0,75%",   9,  0,   3.5, 0.75],
        ["0-10-24 с ПВ 40%",   10,  0,   3.5, 0],
        ["0-12-24",            12,  0,   3.5, 0],
        ["0-12-24 с РК",       12,  6,   3.5, 0],
        ["0-12-24 с ед 9%",    12,  9,   3.5, 0],
        ["0-12-24 с ед 12%",   12, 12,   3.5, 0],
        ["0-14-24",            14,  0,   3.5, 0],
        ["0-14-24 с РК",       14, 11,   3.5, 0],
        ["0-14-24 с ед 14%",   14, 14,   3.5, 0],
        ["0-15-24 с СК 0,75%", 15,  0,   3.5, 0.75],
        ["0-20-24 с ед 12%",   20, 12,   3.5, 0],
        ["0-20-24 с СК 1%",    20,  0,   3.5, 1],
        ["0-25 с СК 1%",       25,  0,   3.5, 1]
    ],

//  другиеПродукты:
//      [Название продукта, Грейс, Единоразовая комиссия, Ежемесячная комиссия, Страховка]
    otherProducts: [
        ["Быстрые Наличные", 0, 5.99, 5.99, 0]
    ]

};
